Охотники_и_рыболовы/src/Catalogs/Охотхозяйства/Охотхозяйства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Охотхозяйства</name>
  <comment>Охотничье хозяйство</comment>
  <predefined>
    <items>
      <name>МоеОхотхозяйство</name>
      <description>Мое охотхозяйство</description>
    </items>
  </predefined>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СубъектРФ</name>
    <type>
      <types>CatalogRef.СубъектыРФ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоГоловноеПредприятие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегиональнаяОрганизация</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленствоККОООР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДниОхоты</name>
    <type>
      <types>EnumRef.УстановленныеДниОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляЗаявления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Охотники_и_рыболовы/src/Catalogs/Охотхозяйства/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Охотхозяйства.Ссылка.Представление КАК ГоловноеПредприятие
		|ИЗ
		|	Справочник.Охотхозяйства КАК Охотхозяйства
		|ГДЕ
		|	НЕ Охотхозяйства.ПометкаУдаления
		|	И Охотхозяйства.ЭтоГоловноеПредприятие
		|	И Охотхозяйства.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ЭтоГоловноеПредприятие И НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		
		Выборка = РезультатЗапроса.Выбрать();
	    Выборка.Следующий();
		ЭтотОбъект.ЭтоГоловноеПредприятие = Ложь;
		
	КонецЕсли;	
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Головное предприятие " + Выборка.ГоловноеПредприятие + " уже существует");	
		ЭтотОбъект.ЭтоГоловноеПредприятие = Ложь;
	Иначе
		Если ЭтоГоловноеПредприятие Тогда
			УстановленнаяКонстанта = Константы.ГоловноеПредприятие.Получить();
			Если УстановленнаяКонстанта = Ссылка Тогда
				Возврат;
			Иначе
				УстановитьПривилегированныйРежим(Истина);
				Менеджер = Константы.ГоловноеПредприятие.СоздатьМенеджерЗначения();
				Менеджер.Значение = Ссылка;
				Попытка 
					Менеджер.Записать();
				Исключение
					Отказ = Истина;	
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить значение в константу. Попробуйте снова.");	
				КонецПопытки;
				
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ РегиональнаяОрганизация.Пустая() Тогда
		ПроверяемыеРеквизиты.Добавить("ИНН");
		ПроверяемыеРеквизиты.Добавить("НаименованиеПолное");
		ПроверяемыеРеквизиты.Добавить("СубъекиРФ");
	КонецЕсли;	
КонецПроцедуры
